# Bike Rental Data - Raw Exploratory Analysis 
### Ritu Pardasani

I have explored the data set using pandas library of python. I have made some transformations to data to gather desired results. Everything is explained with the code.

In [1]:
import pandas as pd #to work with dataframes
#Following 3 imports to make graphs/plots
import matplotlib.pyplot as plt
import matplotlib
import seaborn as sns
import numpy as np
import math

In [2]:
#reading the csv to a dataframe and preventing unicode - decode error 
df = pd.read_csv('2017-fordgobike-tripdata.csv', sep=',', header=0, low_memory=False , encoding='latin-1') 
df.head() #to see how does the data look like

,duration_sec,start_time,end_time,start_station_id,start_station_name,start_station_latitude,start_station_longitude,end_station_id,end_station_name,end_station_latitude,end_station_longitude,bike_id,user_type,member_birth_year,member_gender
0,80110,2017-12-31 16:57:39.6540,2018-01-01 15:12:50.2450,74,Laguna St at Hayes St,37.776435,-122.426244,43,San Francisco Public Library (Grove St at Hyde...,37.778768,-122.415929,96,Customer,1987.0,Male
1,78800,2017-12-31 15:56:34.8420,2018-01-01 13:49:55.6170,284,Yerba Buena Center for the Arts (Howard St at ...,37.784872,-122.400876,96,Dolores St at 15th St,37.766210,-122.426614,88,Customer,1965.0,Female
2,45768,2017-12-31 22:45:48.4110,2018-01-01 11:28:36.8830,245,Downtown Berkeley BART,37.870348,-122.267764,245,Downtown Berkeley BART,37.870348,-122.267764,1094,Customer,NaN,NaN
3,62172,2017-12-31 17:31:10.6360,2018-01-01 10:47:23.5310,60,8th St at Ringold St,37.774520,-122.409449,5,Powell St BART Station (Market St at 5th St),37.783899,-122.408445,2831,Customer,NaN,NaN
4,43603,2017-12-31 14:23:14.0010,2018-01-01 02:29:57.5710,239,Bancroft Way at Telegraph Ave,37.868813,-122.258764,247,Fulton St at Bancroft Way,37.867789,-122.265896,3167,Subscriber,1997.0,Female

## Average of Trip Duration in Minutes

In [14]:
df['duration_sec'].mean() / 60

18.316825347957156

## Standard Deviation of Trip Duration in Minutes

In [15]:
df['duration_sec'].std() /60

57.402440854121856

## Using Describe Function on Trip Duration:
This function directly gives us some facts for starters like count of records, mean, standard deviation, minimum value, 25th, 50th, 75th percentiles, maximum value, name of coloumn and type. I applied this function to just get an idea of this coloumn.

In [23]:
df['duration_sec'].describe

count    519700.000000
mean       1099.009521
std        3444.146451
min          61.000000
25%         382.000000
50%         596.000000
75%         938.000000
max       86369.000000
Name: duration_sec, dtype: float64

## Code to get the busiest dates: 
Here I have considered not just the start dates but also the end dates because some bikes have been rented for more that 24 hours with the 3-day pass. Thus I decided to get an accurate number for the busiest dates and consider the complete trips of each record.

In [25]:
## creating a new temporary dataframe df2 with just the dates coloumns
df2 = df[['start_time', 'end_time']]

In [26]:
df2.head()

                 start_time                  end_time
0  2017-12-31 16:57:39.6540  2018-01-01 15:12:50.2450
1  2017-12-31 15:56:34.8420  2018-01-01 13:49:55.6170
2  2017-12-31 22:45:48.4110  2018-01-01 11:28:36.8830
3  2017-12-31 17:31:10.6360  2018-01-01 10:47:23.5310
4  2017-12-31 14:23:14.0010  2018-01-01 02:29:57.5710

In [32]:
## Since these coloums have date and time both. I had to remove the time part
##creating a function to just get the date out of the date and time from those columns 
def getDate(time_str):
    return (time_str.split(" ")[0])

In [40]:
df2['start_time'] = df2['start_time'].apply(getDate) ## applied that function to start date coloumn

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [42]:
df2['end_time'] = df2['end_time'].apply(getDate) ## applied that function to end date coloumn

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

### Counting the records on those dates

In [141]:
date_count = df2.start_time.value_counts()

In [142]:
date_count

2017-10-26    4682
2017-11-07    4528
2017-11-14    4487
2017-10-24    4473
2017-12-06    4391
2017-10-04    4380
2017-11-09    4367
2017-10-23    4356
2017-10-25    4340
2017-12-05    4338
2017-12-07    4330
2017-10-03    4323
2017-12-11    4303
2017-11-02    4299
2017-12-12    4275
2017-11-29    4270
2017-11-30    4265
2017-10-05    4265
2017-12-13    4262
2017-11-01    4259
2017-12-14    4229
2017-11-28    4221
2017-10-27    4215
2017-10-31    4209
2017-11-06    4205
2017-09-27    4183
2017-09-28    4166
2017-12-01    4124
2017-11-08    4106
2017-09-19    4098
              ...
2017-07-12    1556
2017-07-11    1506
2017-08-06    1494
2017-12-26    1453
2017-07-22    1449
2017-12-30    1444
2017-12-31    1410
2017-07-10    1347
2017-07-29    1333
2017-07-30    1278
2017-07-06    1277
2017-07-23    1190
2017-11-23    1186
2017-07-07    1126
2017-07-05    1103
2017-07-15    1086
2017-06-30    1038
2017-06-29    1019
2017-07-16     955
2017-12-23     935
2017-12-24     819
2017-12-25     712
2017-11-26     693
2017-07-08     659
2017-06-28     632
2017-07-03     600
2017-07-04     558
2017-07-02     523
2017-07-01     475
2017-07-09     433
Name: start_time, Length: 187, dtype: int64

In [143]:
## code to consider multiple dates rental records
mask = (df2['start_time'] < df2['end_time'])
df3 = (df2.loc[mask])

In [144]:
df3.head()

   start_time    end_time
0  2017-12-31  2018-01-01
1  2017-12-31  2018-01-01
2  2017-12-31  2018-01-01
3  2017-12-31  2018-01-01
4  2017-12-31  2018-01-01

In [145]:
## adding those days of the multiple dates to the original count one by one using a for loop for the whole data

from datetime import datetime
from datetime import timedelta
date_format = "%Y-%m-%d"

for index, row in df3.iterrows():
    a = datetime.strptime(row['start_time'], date_format)
    b = datetime.strptime(row['end_time'], date_format)
    delta = b - a
    for i in range(1,delta.days + 1):
        date = str((a + timedelta(i)).date())
        if date in date_count:
            date_count[date] += 1
        else: 
            date_count[date] = 1

### The busiest dates are as follows:

In [146]:
date_count.head()

2017-10-26    4694
2017-11-07    4532
2017-11-14    4494
2017-10-24    4481
2017-12-06    4399
Name: start_time, dtype: int64

#### Busiest date is 26th October 2017

## Busiest times:

In [185]:
## making a temporary dataframe with just the start time and end time coloumns with trip duration
df4 = df[['duration_sec', 'start_time', 'end_time']]

In [186]:
df4.head()

   duration_sec                start_time                  end_time
0         80110  2017-12-31 16:57:39.6540  2018-01-01 15:12:50.2450
1         78800  2017-12-31 15:56:34.8420  2018-01-01 13:49:55.6170
2         45768  2017-12-31 22:45:48.4110  2018-01-01 11:28:36.8830
3         62172  2017-12-31 17:31:10.6360  2018-01-01 10:47:23.5310
4         43603  2017-12-31 14:23:14.0010  2018-01-01 02:29:57.5710

In [209]:
## getting the count of records for each hour of the day in a 24 hour clock 
time_count = {}
date_format = "%Y-%m-%d %H:%M:%S.%f"
for index, row in df4.iterrows():
    a = datetime.strptime(row['start_time'],date_format).hour
    hours = int(row['duration_sec']/3600)
    for i in range(hours + 1):
        if (a+i)%24 in time_count:
            time_count[(a+i)%24] += 1
        else: 
            time_count[(a+i)%24] = 1

In [210]:
print(time_count)

{16: 45312, 17: 63517, 18: 48916, 19: 28960, 20: 18607, 21: 13581, 22: 9376, 23: 6189, 0: 3867, 1: 2620, 2: 2098, 3: 1627, 4: 1867, 5: 3367, 6: 10131, 7: 28016, 8: 58517, 9: 46969, 10: 27151, 11: 26944, 12: 30932, 13: 31270, 14: 29201, 15: 32811}

#### Busiest times are 8 am and 5 pm with maximum number of records

## Busiest start station with maximum number of bike rentals

In [215]:
Start_station_count = df.start_station_name.value_counts()
Start_station_count.head()

San Francisco Ferry Building (Harry Bridges Plaza)           15187
The Embarcadero at Sansome St                                13664
San Francisco Caltrain (Townsend St at 4th St)               12546
San Francisco Caltrain Station 2  (Townsend St at 4th St)    12055
Market St at 10th St                                         11960
Name: start_station_name, dtype: int64

#### Busiest station is "San Francisco Ferry Building(Harry Brudges Plaza)"

## Busiest start station with maximum number of bike rentals

In [216]:
End_station_count = df.end_station_name.value_counts()
End_station_count.head()

San Francisco Caltrain (Townsend St at 4th St)               17378
San Francisco Ferry Building (Harry Bridges Plaza)           17109
The Embarcadero at Sansome St                                16531
San Francisco Caltrain Station 2  (Townsend St at 4th St)    13658
Montgomery St BART Station (Market St at 2nd St)             13443
Name: end_station_name, dtype: int64

#### Busiest station is "San Francisco Caltrain (Townsend St at 4th St)"

## User Population Descriptions
#### Adding a calculated age coloumn to the data by getting the age of the users with the help of birth year. 
Since a lot of records dont have birth year so those values are null automatically.

In [219]:
## function to get the age of the member 
def getAge(birth_year):
    if birth_year == 'NaN':
        return 'Nan'
    else:
        return 2018 - birth_year

df['age'] = df.apply(lambda x: getAge(x['member_birth_year']), axis=1)

In [220]:
df.head()

,duration_sec,start_time,end_time,start_station_id,start_station_name,start_station_latitude,start_station_longitude,end_station_id,end_station_name,end_station_latitude,end_station_longitude,bike_id,user_type,member_birth_year,member_gender,age
0,80110,2017-12-31 16:57:39.6540,2018-01-01 15:12:50.2450,74,Laguna St at Hayes St,37.776435,-122.426244,43,San Francisco Public Library (Grove St at Hyde...,37.778768,-122.415929,96,Customer,1987.0,Male,31.0
1,78800,2017-12-31 15:56:34.8420,2018-01-01 13:49:55.6170,284,Yerba Buena Center for the Arts (Howard St at ...,37.784872,-122.400876,96,Dolores St at 15th St,37.766210,-122.426614,88,Customer,1965.0,Female,53.0
2,45768,2017-12-31 22:45:48.4110,2018-01-01 11:28:36.8830,245,Downtown Berkeley BART,37.870348,-122.267764,245,Downtown Berkeley BART,37.870348,-122.267764,1094,Customer,NaN,NaN,NaN
3,62172,2017-12-31 17:31:10.6360,2018-01-01 10:47:23.5310,60,8th St at Ringold St,37.774520,-122.409449,5,Powell St BART Station (Market St at 5th St),37.783899,-122.408445,2831,Customer,NaN,NaN,NaN
4,43603,2017-12-31 14:23:14.0010,2018-01-01 02:29:57.5710,239,Bancroft Way at Telegraph Ave,37.868813,-122.258764,247,Fulton St at Bancroft Way,37.867789,-122.265896,3167,Subscriber,1997.0,Female,21.0

### Some exploratory analysis on the age: 
This also showed me that there are some wrong birth years in the data like 1886 because of which one person is 132 years old. So this helps me to remove all the records or not consider these records in my analysis with the age.

In [234]:
age_ride_count = df.age.value_counts()

In [235]:
age_ride_count.head()

33.0    24342
30.0    23610
31.0    22493
34.0    21061
36.0    21005
Name: age, dtype: int64

#### Outliers and wrong data

In [236]:
mask = (df['age'] > 120)
big_age = (df.loc[mask])
big_age

,duration_sec,start_time,end_time,start_station_id,start_station_name,start_station_latitude,start_station_longitude,end_station_id,end_station_name,end_station_latitude,end_station_longitude,bike_id,user_type,member_birth_year,member_gender,age
425817,2546,2017-08-19 17:47:32.1100,2017-08-19 18:29:58.8250,197,El Embarcadero at Grand Ave,37.808848,-122.24968,172,College Ave at Taft Ave,37.841800,-122.251535,1448,Customer,1886.0,Male,132.0
426608,1767,2017-08-19 13:20:02.1700,2017-08-19 13:49:29.7350,235,Union St at 10th St,37.807239,-122.28937,197,El Embarcadero at Grand Ave,37.808848,-122.249680,91,Customer,1886.0,Male,132.0

### Maximum rides have been booked by people in the age group 30-36 years

In [237]:
age_ride_count = pd.DataFrame({'age':age_ride_count.index, 'no of rides':age_ride_count.values})

In [238]:
age_ride_count

      age  no of rides
0    33.0        24342
1    30.0        23610
2    31.0        22493
3    34.0        21061
4    36.0        21005
5    32.0        20134
6    35.0        19270
7    29.0        19202
8    28.0        16832
9    27.0        16009
10   37.0        15132
11   38.0        14817
12   25.0        13394
13   39.0        12691
14   26.0        11928
15   41.0        11798
16   43.0        11454
17   40.0        10845
18   24.0         9932
19   45.0         9230
20   44.0         9186
21   50.0         9038
22   42.0         8782
23   53.0         7926
24   47.0         7892
25   48.0         7599
26   51.0         6650
27   46.0         6645
28   23.0         6616
29   49.0         6556
..    ...          ...
43   61.0         1525
44   63.0         1082
45   66.0          960
46   19.0          899
47   67.0          745
48   68.0          740
49   65.0          596
50   71.0          534
51   69.0          500
52   70.0          464
53   73.0          280
54   74.0          231
55  116.0          217
56   75.0          188
57  118.0          142
58   83.0          134
59   72.0           82
60   76.0           73
61   94.0           66
62   77.0           57
63   85.0           41
64   79.0           37
65   84.0           34
66   90.0           29
67   78.0           29
68   80.0           22
69  107.0           12
70  111.0            7
71  117.0            4
72  132.0            2

[73 rows x 2 columns]

### Describe function on the coloum "age" to get facts like average age and max amd min values

In [239]:
age_ride_count['age'].describe()

count     73.000000
mean      57.616438
std       26.300945
min       19.000000
25%       37.000000
50%       55.000000
75%       73.000000
max      132.000000
Name: age, dtype: float64

## Getiing the Town name with the help of lattitude and longitude of stations:
I used a Google API for getting the Town names by the lattitudes and longitudes of the stations. This takes the data from the google maps and then compares each lattitude/longitude combination and gives the name. Therefore, this code was taking a lot of time to run for about 57,000 records. So a proof of concept I ran it for one row to show it works. If i get cities for all the rows, I can have a further analysis on the city level and link it with various other factors like population of that place, number and type og comapnies, facilities of public transport, tourist spots available and much more.

In [269]:
from urllib.request import urlopen
import json
def getPlace(start_station_latitude, start_station_longitude):
    url = "http://maps.googleapis.com/maps/api/geocode/json?"
    url += "latlng=%s,%s&sensor=false" % (start_station_latitude, start_station_longitude)
    v = urlopen(url).read()
    j = json.loads(v)
    components = j['results'][0]['address_components']
    town = None
    for c in components:
        if "postal_town" in c['types']:
            town = c['long_name']
        if "administrative_area_level_2" in c['types']:
            town = c['long_name']
    return town
dfTest = df.head(1)
for index,row in dfTest.iterrows():
    town = getPlace(row['start_station_latitude'], row['start_station_longitude'])

In [270]:
town

'San Francisco County'

## Most Popular Routes:
This is also a very inetersting insight because then we know the busiest routes and this can help us to have a count of minimum number of bikes that should be available of these stations. 

Now the station routes can be A to B and B to A as well, for this analysis I ahve taken these routes as two different directions rather than unidirectional because making it unidirection doesn't give us the exact number of rentals of either of stations.

I applied group by on the combination of start station name and end station name and counted the index, since thats the only unique value I had, Thus this gave me number of rides for each route.

In [288]:
df_routes  = df.groupby(["start_station_name", "end_station_name"]).size().reset_index(name="No_of_rides")

In [333]:
df_routes.head()

      start_station_name          end_station_name  No_of_rides
0  10th Ave at E 15th St     10th Ave at E 15th St           20
1  10th Ave at E 15th St      10th St at Fallon St           16
2  10th Ave at E 15th St        12th St at 4th Ave            3
3  10th Ave at E 15th St        12th St at 6th Ave            3
4  10th Ave at E 15th St  19th Street BART Station            2

### Maximum number of rides are from San Francisco Ferry Building to The Embarcadero at Sansome St	- making this as the most popular route

In [337]:
df_routes.sort_values('No_of_rides', ascending=False).head()

,start_station_name,end_station_name,No_of_rides
15860,San Francisco Ferry Building (Harry Bridges Pl...,The Embarcadero at Sansome St,3344
17947,The Embarcadero at Sansome St,Steuart St at Market St,1793
17941,The Embarcadero at Sansome St,San Francisco Ferry Building (Harry Bridges Pl...,1734
5282,Berry St at 4th St,San Francisco Ferry Building (Harry Bridges Pl...,1686
2692,2nd St at S Park St,Montgomery St BART Station (Market St at 2nd St),1509